# SpaceArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceArea Property
ParameterTypeId Class See Also
---
"Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace